"""
1)є строка:
greeting = 'Hello, world'
записати кожний символ як окремий елемент списку і зробити його заглавним:
['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']

2) з диапозону від 0-50 записати тільки не парні числа при цьому піднести їх до квадрату
приклад:
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
"""
# 1)
greeting = 'Hello, world'
result_task_1 = [i.upper() for i in greeting]
print('Task.1: ', result_task_1)
print('-' * 20)

# 2)
result_task_2 = [x ** 2 for x in range(0, 50) if x % 2 != 0]
print('Task.2: ', result_task_2)
print('-' * 20)
